Document/Report/Tuan18/thanh qua/projectNetbean/DemoXSD/XSD_CommApp/src/jbiServiceUnits/demoXSD_Object/insertUser1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="insertUser1" targetNamespace="http://j2ee.netbeans.org/wsdl/demoXSD_Object/insertUser1"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/demoXSD_Object/insertUser1" xmlns:ns="http://xml.netbeans.org/schema/User1" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/demoXSD_Object/insertUser1">
            <xsd:import namespace="http://xml.netbeans.org/schema/User1" schemaLocation="XSD/User1.xsd"/>
        </xsd:schema>
    </types>
    <message name="insertUser1OperationRequest">
        <part name="User1" element="ns:User"/>
    </message>
    <message name="insertUser1OperationResponse">
        <part name="part1" element="ns:User"/>
    </message>
    <portType name="insertUser1PortType">
        <operation name="insertUser1Operation">
            <input name="input1" message="tns:insertUser1OperationRequest"/>
            <output name="output1" message="tns:insertUser1OperationResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="insertUser1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="insertUser1PortTypeRole" portType="tns:insertUser1PortType"/>
    </plnk:partnerLinkType>
</definitions>

