trunk/Document/Report/Tuan18/thanh qua/projectNetbean/DemoXSD/XSD_CommApp/test/TestUser1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:user="http://xml.netbeans.org/schema/User1">
  <soapenv:Body>
    <user:User>
      <user:id>1</user:id>
      <user:name>adasd</user:name>
      <user:age>12</user:age>
      <user:phone>sadasdad</user:phone>
      <user:TaiKhoan>
        <user:id>1</user:id>
        <user:UserName>sdfsfs</user:UserName>
        <user:Passwd>sdfsdfsdfsf</user:Passwd>
      </user:TaiKhoan>
    </user:User>
  </soapenv:Body>
</soapenv:Envelope>